## OpenTofu Plan

**Environment:** `pl-management-dev`
**Directory:** `./1_platform_management/environments/dev`

<details>
<summary>Show Plan Output</summary>

```hcl
Acquiring state lock. This may take a few moments...
data.azurerm_billing_mca_account_scope.billing["platform"]: Reading...
data.azurerm_management_group.tenant_root: Reading...
data.azurerm_billing_mca_account_scope.billing["platform"]: Read complete after 0s [id=/providers/Microsoft.Billing/billingAccounts/ffbe90e4-4c92-51f3-62db-7a172bf13a15:6bd78d7c-050e-43d3-b328-5b78d77bd526_2019-05-31/billingProfiles/DYXR-KFLN-BG7-PGB/invoiceSections/VD3P-IQFM-PJA-PGB]
data.azurerm_management_group.tenant_root: Read complete after 1s [id=/providers/Microsoft.Management/managementGroups/90d27970-b92c-43dc-9935-1ed557d8e20e]
module.management_management_group.azurerm_management_group.this: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/mg-pl-management-dev-na-01]
module.sandbox_management_group.azurerm_management_group.this: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/mg-sandbox-dev-na-01]
module.platform_connectivity_management_group.azurerm_management_group.this: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/mg-pl-platform-connectivity-dev-na-01]
module.management_subscription_association.azurerm_management_group_subscription_association.this: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/mg-pl-management-dev-na-01/subscriptions/9312c5c5-b089-4b62-bb90-0d92d421d66c]

Note: Objects have changed outside of OpenTofu

OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

  # module.management_management_group.azurerm_management_group.this has changed
  ~ resource "azurerm_management_group" "this" {
        id                         = "/providers/Microsoft.Management/managementGroups/mg-pl-management-dev-na-01"
        name                       = "mg-pl-management-dev-na-01"
      ~ subscription_ids           = [
          + "9312c5c5-b089-4b62-bb90-0d92d421d66c",
        ]
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # azurerm_management_group_policy_assignment.platform_connectivity_deny_delete will be created
  + resource "azurerm_management_group_policy_assignment" "platform_connectivity_deny_delete" {
      + description          = "Prevents deletion of any resources under platform connectivity management group"
      + display_name         = "Deny Delete - Platform Connectivity"
      + enforce              = true
      + id                   = (known after apply)
      + management_group_id  = "/providers/Microsoft.Management/managementGroups/mg-pl-platform-connectivity-dev-na-01"
      + metadata             = (known after apply)
      + name                 = "deny-del-pl-connectivity"
      + policy_definition_id = (known after apply)
    }

  # module.platform_connectivity_subscription.azurerm_management_group_subscription_association.this will be created
  + resource "azurerm_management_group_subscription_association" "this" {
      + id                  = (known after apply)
      + management_group_id = "/providers/Microsoft.Management/managementGroups/mg-pl-platform-connectivity-dev-na-01"
      + subscription_id     = (known after apply)
    }

  # module.platform_connectivity_subscription.azurerm_subscription.this will be created
  + resource "azurerm_subscription" "this" {
      + alias             = "pl-connectivity-dev-na-01"
      + billing_scope_id  = "/providers/Microsoft.Billing/billingAccounts/ffbe90e4-4c92-51f3-62db-7a172bf13a15:6bd78d7c-050e-43d3-b328-5b78d77bd526_2019-05-31/billingProfiles/DYXR-KFLN-BG7-PGB/invoiceSections/VD3P-IQFM-PJA-PGB"
      + id                = (known after apply)
      + subscription_id   = (known after apply)
      + subscription_name = "pl-connectivity-dev-na-01"
      + tags              = {
          + "cost_center" = "platform"
          + "environment" = "dev"
          + "managed_by"  = "opentofu"
          + "owner"       = "kvdb"
          + "project"     = "levendaal"
        }
      + tenant_id         = (known after apply)
    }

  # module.policy_deny_delete.azurerm_policy_definition.deny_delete will be created
  + resource "azurerm_policy_definition" "deny_delete" {
      + description         = "This policy denies all delete operations on resources for maximum protection."
      + display_name        = "Deny Delete Operations - Platform"
      + id                  = (known after apply)
      + management_group_id = "/providers/Microsoft.Management/managementGroups/90d27970-b92c-43dc-9935-1ed557d8e20e"
      + metadata            = jsonencode(
            {
              + category = "Protection"
              + version  = "1.0.0"
            }
        )
      + mode                = "All"
      + name                = "deny-delete-platform"
      + policy_rule         = jsonencode(
            {
              + if   = {
                  + allOf = [
                      + {
                          + exists = "true"
                          + field  = "type"
                        },
                    ]
                }
              + then = {
                  + details = {
                      + actionNames = [
                          + "delete",
                        ]
                    }
                  + effect  = "denyAction"
                }
            }
        )
      + policy_type         = "Custom"
      + role_definition_ids = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/_temp/pl-management-dev-tfplan

To perform exactly these actions, run the following command to apply:
    tofu apply "/home/runner/work/_temp/pl-management-dev-tfplan"
Releasing state lock. This may take a few moments...
```

</details>

*Triggered by @KrijnvanderBurg in commit d96deb837e265081012d0179bea0a2e28b9fe9b9*